brand = ['李宁', '耐克', '阿迪达斯', '鱼c工作室']
slogan = ['一切皆有可能', 'Just do it', 'Impossible is nothing', '让编程改变世界']

print('---------------------------------------------')
print('鱼C工作室的口号是：', slogan[brand.index('鱼c工作室')])
print('---------------------------------------------')

dict1 = {'李宁': '一切皆有可能', '耐克': 'Just do it', '阿迪达斯': 'Impossible is nothing', '鱼C工作室': '让编程改变世界'}
print('鱼C工作室的口号是：', dict1['鱼C工作室'])
print('---------------------------------------------')

dict2 = {1: 'one', 2: 'two', 3: 'three'}
print(dict2[2])
print('---------------------------------------------')

dict3 = {}
print(dict3)
print('---------------------------------------------')
print(help(dict))
print('---------------------------------------------')

dict3 = dict((('F', 70), ('i', 105), ('s', 115), ('h', 104), ('C', 67)))
print(dict3)
print('---------------------------------------------')

dict4 = dict(小甲鱼='让编程改变世界', 苍井空='让AV征服所有宅男')
print(dict4)
print('---------------------------------------------')

dict4['苍井空'] = '所有AV从业者都要通过学习编程来提高职业技能'
print(dict4)
print('---------------------------------------------')

dict4['爱迪生'] = '天才就是99%的汗水加1%的灵感，但这1%的灵感远比99%的汗水更重要'
print(dict4)
print('---------------------------------------------')
